Has there been any updates related to this issue? I'm currently facing the same issue on my end. I'm creating azuredevops_project with terraform and referencing the "Contributors" project group in each. I'm adding members to the Contributor groups all in the same terraform plan. If I remove a project from my terraform files, terraform wants to replace the `azuredevops_group_membership` resources because it requires to read the data sources of the group which doesn't seem right. 
```terraform
  # data.azuredevops_group.project_contributors["<custom id>"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuredevops_group" "project_contributors" {
      + descriptor = (known after apply)
      + id         = (known after apply)
      + name       = "Contributors"
      + origin     = (known after apply)
      + origin_id  = (known after apply)
      + project_id = "<redacted>"
    }

  # azuredevops_group_membership.project_contributors["<custom id>"] must be replaced
-/+ resource "azuredevops_group_membership" "project_contributors" {
      ~ group   = "vssgp.<redacted>" -> (known after apply) # forces replacement
      ~ id      = "<redacted>" -> (known after apply)
        # (2 unchanged attributes hidden)
```